[{
    "year": "upcoming...",
    "talks": [{
        "host":"Community Days 2016 @ Future Decoded",
        "location":"Palazzo del Ghiaccio, via Piranesi - Milano",
        "language":"Ialian",
        "url":"http://www.communitydays.it/events/2016/",
        "date":"6/10/2016 - 7/10/2016",
        "sessions":[{
            "title":"Storia di un lavoratore remoto",
            "abstract":"Lavoro da remoto, come Solution Architect, per Particular Software; Il lavoro da remoto è fantastico, porta tanta autonomia nella mia vita quotidiana, il problema è che più il team \"dispersed\" cresce più la frizione quotidiana aumenta. Obiettivo di questa sessione è rivelare come lavoriamo internamente in Particular Software, come gestiamo la quotidianità, la comunicazione e gli obiettivi di lungo periodo in un'azienda i cui dipendenti sono dispersi su 17 time zone.",
            "url":"http://www.communitydays.it/events/2016/biz03/",
            "slides":"",
            "demos":""
        }]
    },{
        "host":"KLab 2016 #5",
        "location":"Agriturismo Mascudiera, Fiorenzuole d'Arda",
        "language":"Italian",
        "url":"https://www.eventbrite.com/e/klab-2016-5-tickets-27681649559",
        "date":"28/09/2016 18.00",
        "sessions":[{
            "title":"La via verso SOA è lastricata di messaggi",
            "abstract":"Una delle opzioni che abbiamo a disposizione quando decidiamo di implementare un'architettura basata sui principi di SOA è quella di utilizzare un modello a messaggi coadiuvati da un enterpise service bus (ESB), in questa sessione introdurremo i concetti base della messaggistica, i concetti fondanti di SOA, e uniremo i puntini che separano la tecnologia dai principi architetturali, analizzando vantaggi ed eventuali problemi di tale approccio.",
            "url":"",
            "slides":"",
            "demos":""
        }]
    }]
},{
    "year": 2016,
    "talks": [{
        "host":"DevMarche - Social Skills Afternoon",
        "location":"Ancona",
        "language":"Italian",
        "url":"http://lanyrd.com/2016/socialdev/",
        "date":"22/07/2016",
        "sessions":[{
            "title":"Croce e delizia: storia di un lavoratore remoto.",
            "abstract":"Lavoro da remoto, come Solution Architect, per Particular Software. Il lavoro da remoto è fantastico, porta tanta autonomia nella mia vita quotidiana, il problema è che più il team \"dispersed\" cresce, più la frizione quotidiana aumenta. Obiettivo di questa sessione è rivelare come lavoriamo internamente in Particular Software, come gestiamo la quotidianità, la comunicazione e gli obiettivi di lungo periodo in un'azienda i cui dipendenti sono “dispersi” su 17 time zone.",
            "url":"http://lanyrd.com/2016/socialdev/sfdgfh/",
            "slides":"http://www.slideshare.net/mauroservienti/croce-e-delizia-del-lavoro-remoto",
            "demos":"",
            "recording": "https://vimeo.com/176778929"
        }]
    },{
        "host":"UGIdotNET Birthday",
        "location":"Milano",
        "language":"Italian",
        "url":"http://www.ugidotnet.org/eventi/45/Buon-compleanno-UGIdotNET!",
        "date":"19/07/2016",
        "sessions":[{
            "title":"Services UI Composition",
            "abstract":"Un'architettura basata sui comandamenti di SOA genera e guida verso sistemi basati sulla decomposizione dei servizi e sul disaccoppiamento del dominio al fine di creare componenti autonomi. Purtroppo, dato che la UI è il luogo dove aggreghiamo tutte le informazioni per l'utente, ci ritroviamo ad accoppiare nuovamente e spesso velocemente di nuovo tutto. Obiettivo della sessione è di sviscerare il problema fino alle sue radici e proporre alcuni possibili approcci per risolverlo.",
            "url":"",
            "slides":"http://downloads.ugidotnet.org/eventi/2016/15o/Services-UI-Composition-slide.zip",
            "demos":"http://downloads.ugidotnet.org/eventi/2016/15o/Services-UI-Composition-demo.zip",
            "recording": ""
        }]
    }]
}]